### Concatenate rows of two data frames and assign keys

In [2]:
import pandas as pd
df1 = pd.DataFrame({
'ID':[101,102,103,104,105],
'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
'Subject':['Maths','English','Science','German','History']})

df2 = pd.DataFrame(
{'ID':[101,102,103,104,105],
'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
'Subject':['English','Science','Social Science','German','History']})

In [8]:
# Write a code here 
df = pd.concat([df1,df2], keys=['a','b'])
df

      ID    Name         Subject
a 0  101    Alex           Maths
  1  102     Amy         English
  2  103   Allen         Science
  3  104   Alice          German
  4  105  Ayoung         History
b 0  101   Billy         English
  1  102   Brian         Science
  2  103    Bran  Social Science
  3  104   Bryce          German
  4  105   Betty         History